jakijak95/arduino-esp32/libraries/USB/src/USBAudioCard.cpp
// Copyright 2015-2026 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "USBAudioCard.h"
#if SOC_USB_OTG_SUPPORTED
#if CONFIG_TINYUSB_AUDIO_ENABLED

#include "esp32-hal-tinyusb.h"
#include "USBAudioCardDescriptors.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include <math.h>
#include <inttypes.h>

ESP_EVENT_DEFINE_BASE(ARDUINO_USB_AUDIO_CARD_EVENTS);
esp_err_t arduino_usb_event_post(esp_event_base_t event_base, int32_t event_id, void *event_data, size_t event_data_size, TickType_t ticks_to_wait);
esp_err_t arduino_usb_event_handler_register_with(esp_event_base_t event_base, int32_t event_id, esp_event_handler_t event_handler, void *event_handler_arg);

static uint8_t _itf_num = 0;
static uint32_t _sample_rate = 48000;
static uint8_t _spk_channels = 2;
static uint8_t _mic_channels = 2;
static uint8_t _bits_per_sample = 24;
static uint8_t _bytes_per_sample = 4;
static bool _mute[3] = {false, false, false};
static int16_t _volume[3] = {0, 0, 0};
//static int32_t *_mic_buf = NULL; //[CFG_TUD_AUDIO_FUNC_1_EP_IN_SW_BUF_SZ / 4]
static int32_t *_spk_buf = NULL; //[CFG_TUD_AUDIO_FUNC_1_EP_OUT_SW_BUF_SZ / 4]
static arduino_usb_audio_card_data_handler_t _cb = NULL;
static USBAudioCard *_uac = NULL;

uint16_t tusb_audio_load_descriptor(uint8_t *dst, uint8_t *itf) {
  _itf_num = *itf;
#if TUD_OPT_HIGH_SPEED
  uint8_t str_index = tinyusb_add_string_descriptor("TinyUSB UAC2");
  if (_spk_channels == 2 && _mic_channels > 0) {
    // Stereo Headset
    uint8_t ep_num = tinyusb_get_free_duplex_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t int_ep_num = tinyusb_get_free_in_endpoint();
    TU_VERIFY(int_ep_num != 0);
    uint8_t descriptor[TUD_AUDIO20_HEADSET_STEREO_DESC_LEN] = {
      // Interface number, string index, EP Out & EP In & EP Interrupt address, max sample rate, speaker channels, mic channels, bytes per sample RX/TX, bits used per sample RX/TX
      TUD_AUDIO20_HEADSET_STEREO_DESCRIPTOR(_itf_num, str_index, ep_num, ep_num | 0x80, int_ep_num | 0x80, \
        CFG_TUD_AUDIO_MAX_SAMPLE_RATE, \
        _spk_channels,  \
        _mic_channels,  \
        _bytes_per_sample, _bits_per_sample)
    };
    *itf += 3;
    memcpy(dst, descriptor, TUD_AUDIO20_HEADSET_STEREO_DESC_LEN);
    return TUD_AUDIO20_HEADSET_STEREO_DESC_LEN;
  } else if (_spk_channels == 1 && _mic_channels > 0) {
    // Mono Headset
  } else if (_spk_channels == 2 && _mic_channels == 0) {
    // Stereo Speaker
  } else if (_spk_channels == 1 && _mic_channels == 0) {
    // Mono Speaker
  } else if (_spk_channels == 0 && _mic_channels > 0) {
    // Microphone(s)
  }
#else
  uint8_t str_index = tinyusb_add_string_descriptor("TinyUSB UAC1");
  if (_spk_channels == 2 && _mic_channels > 0) {
    // Stereo Headset
    uint8_t ep_num = tinyusb_get_free_duplex_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t descriptor[TUD_AUDIO10_HEADSET_STEREO_DESC_LEN(1)] = {
      // Interface number, string index, EP Out & EP In address, max sample rate, speaker channels, mic channels, bytes per sample RX/TX, bits used per sample RX/TX, sample rate
      TUD_AUDIO10_HEADSET_STEREO_DESCRIPTOR(_itf_num, str_index, ep_num, ep_num | 0x80, \
        48000, \
        _spk_channels,  \
        _mic_channels,  \
        _bytes_per_sample, _bits_per_sample, \
        _sample_rate)
    };
    *itf += 3;
    memcpy(dst, descriptor, TUD_AUDIO10_HEADSET_STEREO_DESC_LEN(1));
    return TUD_AUDIO10_HEADSET_STEREO_DESC_LEN(1);
  } else if (_spk_channels == 1 && _mic_channels > 0) {
    // Mono Headset
    uint8_t ep_num = tinyusb_get_free_duplex_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t descriptor[TUD_AUDIO10_HEADSET_MONO_DESC_LEN(1)] = {
      // Interface number, string index, EP Out & EP In address, max sample rate, speaker channels, mic channels, bytes per sample RX/TX, bits used per sample RX/TX, sample rate
      TUD_AUDIO10_HEADSET_MONO_DESCRIPTOR(_itf_num, str_index, ep_num, ep_num | 0x80, \
        48000, \
        _spk_channels,  \
        _mic_channels,  \
        _bytes_per_sample, _bits_per_sample, \
        _sample_rate)
    };
    *itf += 3;
    memcpy(dst, descriptor, TUD_AUDIO10_HEADSET_MONO_DESC_LEN(1));
    return TUD_AUDIO10_HEADSET_MONO_DESC_LEN(1);
  } else if (_spk_channels == 2 && _mic_channels == 0) {
    // Stereo Speaker
    uint8_t ep_num = tinyusb_get_free_out_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t descriptor[TUD_AUDIO10_SPEAKER_STEREO_DESC_LEN(1)] = {
      // Interface number, string index, EP Out address, max sample rate, speaker channels, bytes per sample RX/TX, bits used per sample RX/TX, sample rate
      TUD_AUDIO10_SPEAKER_STEREO_DESCRIPTOR(_itf_num, str_index, ep_num, \
        48000, \
        _spk_channels,  \
        _bytes_per_sample, _bits_per_sample, \
        _sample_rate)
    };
    *itf += 2;
    memcpy(dst, descriptor, TUD_AUDIO10_SPEAKER_STEREO_DESC_LEN(1));
    return TUD_AUDIO10_SPEAKER_STEREO_DESC_LEN(1);
  } else if (_spk_channels == 1 && _mic_channels == 0) {
    // Mono Speaker
    uint8_t ep_num = tinyusb_get_free_out_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t descriptor[TUD_AUDIO10_SPEAKER_MONO_DESC_LEN(1)] = {
      // Interface number, string index, EP Out address, max sample rate, speaker channels, bytes per sample RX/TX, bits used per sample RX/TX, sample rate
      TUD_AUDIO10_SPEAKER_MONO_DESCRIPTOR(_itf_num, str_index, ep_num, \
        48000, \
        _spk_channels,  \
        _bytes_per_sample, _bits_per_sample, \
        _sample_rate)
    };
    *itf += 2;
    memcpy(dst, descriptor, TUD_AUDIO10_SPEAKER_MONO_DESC_LEN(1));
    return TUD_AUDIO10_SPEAKER_MONO_DESC_LEN(1);
  } else if (_spk_channels == 0 && _mic_channels > 0) {
    // Microphone(s)
    uint8_t ep_num = tinyusb_get_free_in_endpoint();
    TU_VERIFY(ep_num != 0);
    uint8_t descriptor[TUD_AUDIO10_MICROPHONE_DESC_LEN(1)] = {
      // Interface number, string index, EP In address, max sample rate, microphone channels, bytes per sample RX/TX, bits used per sample RX/TX, sample rate
      TUD_AUDIO10_MICROPHONE_DESCRIPTOR(_itf_num, str_index, ep_num| 0x80, \
        48000, \
        _mic_channels,  \
        _bytes_per_sample, _bits_per_sample, \
        _sample_rate)
    };
    *itf += 2;
    memcpy(dst, descriptor, TUD_AUDIO10_MICROPHONE_DESC_LEN(1));
    return TUD_AUDIO10_MICROPHONE_DESC_LEN(1);
  }
#endif
  return 0;
}

