jakijak95/arduino-esp32/libraries/USB/src/USBAudioCard.cpp
USBAudioCard::USBAudioCard(uint32_t sample_rate, UAC_Bits_Per_Sample bps, UAC_SPK_Channels spk_channels, UAC_MIC_Channels mic_channels) {
  if (_uac == NULL) {
    _uac = this;
    _sample_rate = sample_rate;
    _bits_per_sample = (uint8_t)bps;
    _bytes_per_sample = (_bits_per_sample <= 16)?2:4;
    _spk_channels = (uint8_t)spk_channels;
    _mic_channels = (uint8_t)mic_channels;

    uint16_t descriptor_len = 0;
#if TUD_OPT_HIGH_SPEED
    if (_spk_channels == 2 && _mic_channels > 0) {
      // Stereo Headset
      descriptor_len = TUD_AUDIO20_HEADSET_STEREO_DESC_LEN;
    } else if (_spk_channels == 1 && _mic_channels > 0) {
      // Mono Headset
    } else if (_spk_channels == 2 && _mic_channels == 0) {
      // Stereo Speaker
    } else if (_spk_channels == 1 && _mic_channels == 0) {
      // Mono Speaker
    } else if (_spk_channels == 0 && _mic_channels > 0) {
      // Microphone(s)
    }
#else
    if (_spk_channels == 2 && _mic_channels > 0) {
      // Stereo Headset
      descriptor_len = TUD_AUDIO10_HEADSET_STEREO_DESC_LEN(1);
    } else if (_spk_channels == 1 && _mic_channels > 0) {
      // Mono Headset
      descriptor_len = TUD_AUDIO10_HEADSET_MONO_DESC_LEN(1);
    } else if (_spk_channels == 2 && _mic_channels == 0) {
      // Stereo Speaker
      descriptor_len = TUD_AUDIO10_SPEAKER_STEREO_DESC_LEN(1);
    } else if (_spk_channels == 1 && _mic_channels == 0) {
      // Mono Speaker
      descriptor_len = TUD_AUDIO10_SPEAKER_MONO_DESC_LEN(1);
    } else if (_spk_channels == 0 && _mic_channels > 0) {
      // Microphone(s)
      descriptor_len = TUD_AUDIO10_MICROPHONE_DESC_LEN(1);
    }
#endif
    tinyusb_enable_interface(USB_INTERFACE_AUDIO, descriptor_len, tusb_audio_load_descriptor);
  }
}

TaskHandle_t _uacReceiveTaskHandle = NULL;
void _uacReceiveTask(void *pvParameters) {
  for (;;) {
    uint16_t len = tud_audio_read(_spk_buf, CFG_TUD_AUDIO_FUNC_1_EP_OUT_SW_BUF_SZ);
    if (_cb) {
      _cb(_spk_buf, len);
    }
    delay(2);
  }
}

#define dump_control_request(p_request) log_v("Control request: bRequest = 0x%x, wValue = 0x%x, wIndex = 0x%x, wLength = 0x%x", p_request->bRequest, p_request->wValue, p_request->wIndex, p_request->wLength)

// Invoked when audio class specific set request received for an EP
bool tud_audio_set_req_ep_cb(uint8_t rhport, tusb_control_request_t const *p_request, uint8_t *pBuff) {
  (void) rhport;
  dump_control_request(p_request);
#if TUD_OPT_HIGH_SPEED
  (void) pBuff;
  (void) p_request;
  return false;
#else
  uint8_t ctrlSel = TU_U16_HIGH(p_request->wValue);
  if (ctrlSel == AUDIO10_EP_CTRL_SAMPLING_FREQ && p_request->bRequest == AUDIO10_CS_REQ_SET_CUR && p_request->wLength == 3) {
    _sample_rate = tu_unaligned_read32(pBuff) & 0x00FFFFFF;
    log_d("EP set current freq: %" PRIu32, _sample_rate);
    // Send SAMPLE RATE Event
    arduino_usb_audio_card_event_data_t p;
    p.sample_rate.rate = _sample_rate;
    arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_SAMPLE_RATE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
    return true;
  }
  log_w("Set EP request not handled, ctrlSel = %d, bRequest = %d, wLength = %d", ctrlSel, p_request->bRequest, p_request->wLength);
  return false;
#endif
}

// Invoked when audio class specific get request received for an EP
bool tud_audio_get_req_ep_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
  dump_control_request(p_request);
#if TUD_OPT_HIGH_SPEED
  (void) rhport;
  (void) p_request;
  return false;
#else
  uint8_t ctrlSel = TU_U16_HIGH(p_request->wValue);
  if (ctrlSel == AUDIO10_EP_CTRL_SAMPLING_FREQ && p_request->bRequest == AUDIO10_CS_REQ_GET_CUR) {
    log_d("EP get current freq");
    uint8_t freq[3];
    freq[0] = (uint8_t) (_sample_rate & 0xFF);
    freq[1] = (uint8_t) ((_sample_rate >> 8) & 0xFF);
    freq[2] = (uint8_t) ((_sample_rate >> 16) & 0xFF);
    return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, freq, sizeof(freq));
  }
  log_w("Get EP request not handled, ctrlSel = %d, bRequest = %d, wLength = %d", ctrlSel, p_request->bRequest, p_request->wLength);
  return false;
#endif
}

// Invoked when audio class specific get request received for an entity
bool tud_audio_get_req_entity_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
  dump_control_request(p_request);
#if TUD_OPT_HIGH_SPEED
  audio20_control_request_t const *request = (audio20_control_request_t const *) p_request;
  if (request->bEntityID == UAC2_ENTITY_CLOCK) {
    if (request->bControlSelector == AUDIO20_CS_CTRL_SAM_FREQ) {
      if (request->bRequest == AUDIO20_CS_REQ_CUR) {
        log_d("Clock get current freq %" PRIu32, _sample_rate);
        audio20_control_cur_4_t curf = {(int32_t) tu_htole32(_sample_rate)};
        return tud_audio_buffer_and_schedule_control_xfer(rhport, (tusb_control_request_t const *) request, &curf, sizeof(curf));
      } else if (request->bRequest == AUDIO20_CS_REQ_RANGE) {
        audio20_control_range_4_n_t(1) rangef = {.wNumSubRanges = tu_htole16(1)};
        rangef.subrange[0].bMin = (int32_t) _sample_rate;
        rangef.subrange[0].bMax = (int32_t) _sample_rate;
        rangef.subrange[0].bRes = 0;
        log_d("Clock Range %d, %d, %d", (int) rangef.subrange[0].bMin, (int) rangef.subrange[0].bMax, (int) rangef.subrange[0].bRes);
        return tud_audio_buffer_and_schedule_control_xfer(rhport, (tusb_control_request_t const *) request, &rangef, sizeof(rangef));
      }
    } else if (request->bControlSelector == AUDIO20_CS_CTRL_CLK_VALID && request->bRequest == AUDIO20_CS_REQ_CUR) {
      audio20_control_cur_1_t cur_valid = {.bCur = 1};
      log_d("Clock get is valid %u", cur_valid.bCur);
      return tud_audio_buffer_and_schedule_control_xfer(rhport, (tusb_control_request_t const *) request, &cur_valid, sizeof(cur_valid));
    }
    log_w("Clock get request not supported, entity = %u, selector = %u, request = %u", request->bEntityID, request->bControlSelector, request->bRequest);
    return false;
  } else if (request->bEntityID == UAC2_ENTITY_SPK_FEATURE_UNIT) {
    uint8_t channel = request->bChannelNumber;
    if (channel != 0 && channel > _spk_channels) {  
      log_w("Invalid speaker channel %u for feature unit get request (spk_channels=%u)", channel, _spk_channels);  
      return false;  
    } 
    if (request->bControlSelector == AUDIO20_FU_CTRL_MUTE && request->bRequest == AUDIO20_CS_REQ_CUR) {
      audio20_control_cur_1_t mute1 = {.bCur = _mute[request->bChannelNumber]};
      log_d("Get channel %u mute %d", request->bChannelNumber, mute1.bCur);
      return tud_audio_buffer_and_schedule_control_xfer(rhport, (tusb_control_request_t const *) request, &mute1, sizeof(mute1));
    } else if (request->bControlSelector == AUDIO20_FU_CTRL_VOLUME) {
      if (request->bRequest == AUDIO20_CS_REQ_RANGE) {
        audio20_control_range_2_n_t(1) range_vol = { .wNumSubRanges = tu_htole16(1), .subrange = {{.bMin = tu_htole16(-50 * 256), .bMax = tu_htole16(0), .bRes = tu_htole16(256)}}};
        log_d("Get channel %u volume range (%d, %d, %u) dB", request->bChannelNumber, range_vol.subrange[0].bMin / 256, range_vol.subrange[0].bMax / 256, range_vol.subrange[0].bRes / 256);
        return tud_audio_buffer_and_schedule_control_xfer(rhport, (tusb_control_request_t const *) request, &range_vol, sizeof(range_vol));
      } else if (request->bRequest == AUDIO20_CS_REQ_CUR) {
        audio20_control_cur_2_t cur_vol = {.bCur = tu_htole16(_volume[request->bChannelNumber])};
        log_d("Get channel %u volume %d dB", request->bChannelNumber, cur_vol.bCur / 256);
        return tud_audio_buffer_and_schedule_control_xfer(rhport, (tusb_control_request_t const *) request, &cur_vol, sizeof(cur_vol));
      }
    }
    log_w("Feature unit get request not supported, entity = %u, selector = %u, request = %u", request->bEntityID, request->bControlSelector, request->bRequest);
    return false;
  }
  log_w("Get request not handled, entity = %d, selector = %d, request = %d", request->bEntityID, request->bControlSelector, request->bRequest);
  return false;
#else
  uint8_t channelNum = TU_U16_LOW(p_request->wValue);
  uint8_t ctrlSel = TU_U16_HIGH(p_request->wValue);
  uint8_t entityID = TU_U16_HIGH(p_request->wIndex);

