jakijak95/arduino-esp32/libraries/USB/src/USBAudioCard.cpp
  if (entityID == UAC1_ENTITY_SPK_FEATURE_UNIT) {
    if (ctrlSel == AUDIO10_FU_CTRL_MUTE) {
      uint8_t muted = _mute[channelNum];
      log_d("Get Mute of channel: %u", channelNum);
      return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &muted, 1);
    } else if (ctrlSel == AUDIO10_FU_CTRL_VOLUME) {
      if (p_request->bRequest == AUDIO10_CS_REQ_GET_CUR) {
        log_d("Get Volume of channel: %u", channelNum);
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &_volume[channelNum], sizeof(_volume[channelNum]));
      } else if (p_request->bRequest == AUDIO10_CS_REQ_GET_MIN) {
        log_d("Get Volume min of channel: %u", channelNum);
        int16_t vol_min = (int16_t)(-50 * 256);
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &vol_min, sizeof(vol_min));
      } else if (p_request->bRequest == AUDIO10_CS_REQ_GET_MAX) {
        log_d("Get Volume max of channel: %u", channelNum);
        int16_t vol_max = 0;
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &vol_max, sizeof(vol_max));
      } else if (p_request->bRequest == AUDIO10_CS_REQ_GET_RES) {
        log_d("Get Volume res of channel: %u", channelNum);
        int16_t vol_res = 256; // 1 dB in 1/256 dB units
        return tud_audio_buffer_and_schedule_control_xfer(rhport, p_request, &vol_res, sizeof(vol_res));
      } else {
        log_w("Get Volume request not supported, entityID = %d, ctrlSel = %d, bRequest = %d, wLength = %d", entityID, ctrlSel, p_request->bRequest, p_request->wLength);
        return false;
      }
    }
  }
  log_w("Get request not handled, entityID = %d, ctrlSel = %d, bRequest = %d, wLength = %d", entityID, ctrlSel, p_request->bRequest, p_request->wLength);
  return false;
#endif
}

// Invoked when audio class specific set request received for an entity
bool tud_audio_set_req_entity_cb(uint8_t rhport, tusb_control_request_t const *p_request, uint8_t *buf) {
  (void) rhport;
  dump_control_request(p_request);
#if TUD_OPT_HIGH_SPEED
  audio20_control_request_t const *request = (audio20_control_request_t const *) p_request;
  if (request->bEntityID == UAC2_ENTITY_SPK_FEATURE_UNIT && request->bRequest == AUDIO20_CS_REQ_CUR) {
    if (request->bControlSelector == AUDIO20_FU_CTRL_MUTE) {
      TU_VERIFY(request->wLength == sizeof(audio20_control_cur_1_t));
      _mute[request->bChannelNumber] = ((audio20_control_cur_1_t const *) buf)->bCur;
      log_d("Set channel %d Mute: %d", request->bChannelNumber, _mute[request->bChannelNumber]);
      // Send MUTE Event
      arduino_usb_audio_card_event_data_t p;
      p.mute.channel = (UAC_Channel)request->bChannelNumber;
      p.mute.muted = _mute[request->bChannelNumber];
      arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_MUTE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
      return true;
    } else if (request->bControlSelector == AUDIO20_FU_CTRL_VOLUME) {
      TU_VERIFY(request->wLength == sizeof(audio20_control_cur_2_t));
      _volume[request->bChannelNumber] = ((audio20_control_cur_2_t const *) buf)->bCur;
      log_d("Set channel %d volume: %d dB", request->bChannelNumber, _volume[request->bChannelNumber] / 256);
      // Send Volume Event
      arduino_usb_audio_card_event_data_t p;
      p.volume.channel = (UAC_Channel)request->bChannelNumber;
      p.volume.db = _volume[request->bChannelNumber] / 256;
      arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_VOLUME_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
      return true;
    }
    log_w("Feature unit set request not supported, entity = %u, selector = %u, request = %u", request->bEntityID, request->bControlSelector, request->bRequest);
    return false;
  } else if (request->bEntityID == UAC2_ENTITY_CLOCK && request->bRequest == AUDIO20_CS_REQ_CUR) {
    if (request->bControlSelector == AUDIO20_CS_CTRL_SAM_FREQ) {
      TU_VERIFY(request->wLength == sizeof(audio20_control_cur_4_t));
      _sample_rate = (uint32_t) ((audio20_control_cur_4_t const *) buf)->bCur;
      log_d("Clock set current freq: %" PRIu32, _sample_rate);
      // Send SAMPLE RATE Event
      arduino_usb_audio_card_event_data_t p;
      p.sample_rate.rate = _sample_rate;
      arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_SAMPLE_RATE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
      return true;
    }
    log_w("Clock set request not supported, entity = %u, selector = %u, request = %u", request->bEntityID, request->bControlSelector, request->bRequest);
    return false;
  }
  log_w("Set request not handled, entity = %d, selector = %d, request = %d", request->bEntityID, request->bControlSelector, request->bRequest);
  return false;
#else
  uint8_t channelNum = TU_U16_LOW(p_request->wValue);
  uint8_t ctrlSel = TU_U16_HIGH(p_request->wValue);
  uint8_t entityID = TU_U16_HIGH(p_request->wIndex);

  if (entityID == UAC1_ENTITY_SPK_FEATURE_UNIT && p_request->bRequest == AUDIO10_CS_REQ_SET_CUR) {
    if (ctrlSel == AUDIO10_FU_CTRL_MUTE && p_request->wLength == 1) {
      _mute[channelNum] = buf[0];
      log_d("Set Mute: %d of channel: %u", _mute[channelNum], channelNum);
      // Send MUTE Event
      arduino_usb_audio_card_event_data_t p;
      p.mute.channel = (UAC_Channel)channelNum;
      p.mute.muted = _mute[channelNum];
      arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_MUTE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
      return true;
    } else if(ctrlSel == AUDIO10_FU_CTRL_VOLUME && p_request->wLength == 2) {
      _volume[channelNum] = (int16_t)tu_unaligned_read16(buf);
      log_d("Set Volume: %d dB of channel: %u", _volume[channelNum] / 256, channelNum);
      // Send Volume Event
      arduino_usb_audio_card_event_data_t p;
      p.volume.channel = (UAC_Channel)channelNum;
      p.volume.db = _volume[channelNum] / 256;
      arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_VOLUME_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
      return true;
    }
  }
  log_w("Set request not handled, entityID = %d, ctrlSel = %d, bRequest = %d, wLength = %d", entityID, ctrlSel, p_request->bRequest, p_request->wLength);
  return false;
#endif
}

bool tud_audio_set_itf_close_ep_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
  (void) rhport;
  dump_control_request(p_request);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG
  uint8_t const itf = tu_u16_low(tu_le16toh(p_request->wIndex));
  uint8_t const alt = tu_u16_low(tu_le16toh(p_request->wValue));
  log_d("Close EP interface %d alt %d", itf, alt);
#endif
  return true;
}

bool tud_audio_set_itf_cb(uint8_t rhport, tusb_control_request_t const *p_request) {
  (void) rhport;
  dump_control_request(p_request);
  uint8_t const itf = tu_u16_low(tu_le16toh(p_request->wIndex));
  uint8_t const alt = tu_u16_low(tu_le16toh(p_request->wValue));
  log_d("Set interface %d alt %d", itf, alt);
  // Send Interface Event
  arduino_usb_audio_card_event_data_t p;
  if (_spk_channels > 0 && itf == 1) {
    p.interface_enable.interface = UAC_INTERFACE_SPK;
  } else if (_spk_channels == 0 && itf == 1) {
    p.interface_enable.interface = UAC_INTERFACE_MIC;
  } else {
    p.interface_enable.interface = UAC_INTERFACE_MIC;
  }
  p.interface_enable.enable = alt != 0;
  arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_INTERFACE_ENABLE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
  return true;
}

USBAudioCard::~USBAudioCard() {
  end();
  _uac = NULL;
}

