jakijak95/arduino-esp32/libraries/USB/src/USBAudioCard.cpp
bool USBAudioCard::begin() {
  if (_spk_channels > 0 && _spk_buf == NULL) {
    _spk_buf = (int32_t*)malloc(CFG_TUD_AUDIO_FUNC_1_EP_OUT_SW_BUF_SZ);
    if (_spk_buf == NULL) {
      log_e("Failed to allocate speaker data buffer!");
      return false;
    }
    // spawn receive task
    BaseType_t created = xTaskCreate(_uacReceiveTask, "uacReceiveTask", 8092, this, 5, &_uacReceiveTaskHandle);
    if (created != pdPASS || _uacReceiveTaskHandle == NULL) {
      log_e("Failed to create receive task!");
      free(_spk_buf);
      _spk_buf = NULL;
      return false;
    }
  }
  return true;
}

void USBAudioCard::end() {
  if (_uacReceiveTaskHandle != NULL) {
    vTaskDelete(_uacReceiveTaskHandle);
    _uacReceiveTaskHandle = NULL;
  }
  if (_spk_buf != NULL) {
    free(_spk_buf);
    _spk_buf = NULL;
  }
}

UAC_SPK_Channels USBAudioCard::speakerChannels() {
  return (UAC_SPK_Channels)_spk_channels;
}
UAC_MIC_Channels USBAudioCard::micChannels() {
  return (UAC_MIC_Channels)_mic_channels;
}
UAC_Bits_Per_Sample USBAudioCard::bitsPerSample() {
  return (UAC_Bits_Per_Sample)_bits_per_sample;
}
uint8_t USBAudioCard::bytesPerSample() {
  return _bytes_per_sample;
}
uint32_t USBAudioCard::sampleRate() {
  return _sample_rate;
}

bool USBAudioCard::mute(UAC_Channel channel){
  if (_spk_channels == 0 || channel > _spk_channels) {
    log_e("Bad speaker channel %u", channel);
    return false;
  }
  return _mute[channel];
}

bool USBAudioCard::mute(UAC_Channel channel, bool muted) {
#if CFG_TUD_AUDIO_ENABLE_INTERRUPT_EP
  if (_spk_channels == 0 || channel > _spk_channels) {
    log_e("Bad speaker channel %u", channel);
    return false;
  }

  _mute[channel] = muted;

  // 6.1 Interrupt Data Message
  const audio_interrupt_data_t data = {.v2 = {
      .bInfo = 0,                                      // Class-specific interrupt, originated from an interface
      .bAttribute = AUDIO20_CS_REQ_CUR,                // Caused by current settings
      .wValue_cn_or_mcn = (uint8_t)channel,            // CH0: master volume
      .wValue_cs = AUDIO20_FU_CTRL_MUTE,               // Volume change
      .wIndex_ep_or_int = 0,                           // From the interface itself
      .wIndex_entity_id = UAC2_ENTITY_SPK_FEATURE_UNIT,// From feature unit
  }};

  if (tud_audio_int_write(&data)) {
    // Send MUTE Event
    arduino_usb_audio_card_event_data_t p;
    p.mute.channel = channel;
    p.mute.muted = _mute[channel];
    arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_MUTE_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
    return true;
  }
  return false;
#else
  return false;
#endif
}

int8_t USBAudioCard::volume(UAC_Channel channel) {
  if (_spk_channels == 0 || channel > _spk_channels) {
    log_e("Bad speaker channel %u", channel);
    return false;
  }
  return _volume[channel] / 256;
}

bool USBAudioCard::volume(UAC_Channel channel, int8_t volume_db) {
#if CFG_TUD_AUDIO_ENABLE_INTERRUPT_EP
  if (_spk_channels == 0 || channel > _spk_channels) {
    log_e("Bad speaker channel %u", channel);
    return false;
  }
  _volume[channel] = volume_db * 256;

  // 6.1 Interrupt Data Message
  const audio_interrupt_data_t data = {.v2 = {
      .bInfo = 0,                                      // Class-specific interrupt, originated from an interface
      .bAttribute = AUDIO20_CS_REQ_CUR,                // Caused by current settings
      .wValue_cn_or_mcn = (uint8_t)channel,            // CH0: master volume
      .wValue_cs = AUDIO20_FU_CTRL_VOLUME,             // Volume change
      .wIndex_ep_or_int = 0,                           // From the interface itself
      .wIndex_entity_id = UAC2_ENTITY_SPK_FEATURE_UNIT,// From feature unit
  }};

  if (tud_audio_int_write(&data)) {
    // Send Volume Event
    arduino_usb_audio_card_event_data_t p;
    p.volume.channel = channel;
    p.volume.db = _volume[channel] / 256;
    arduino_usb_event_post(ARDUINO_USB_AUDIO_CARD_EVENTS, ARDUINO_USB_AUDIO_CARD_VOLUME_EVENT, &p, sizeof(arduino_usb_audio_card_event_data_t), portMAX_DELAY);
    return true;
  }
  return false;
#else
  return false;
#endif
}

// Apply currently set channel volumes directly to audio data (if DAC does not support setting volume)
void USBAudioCard::applyVolume(void *data, uint16_t len) {
  if (_spk_channels == 0) {
    return;
  }
  // Convert volume from 1/256 dB to linear multiplier (Q16 fixed-point)
  // volume[0] ranges from -12800 (-50 dB) to 0 (0 dB) in 1/256 dB units
  if (_mute[0]) {
    memset(data, 0, len);
  } else if (_volume[0] != 0) {
    int32_t vol_mul = _mute[0]?0:(int32_t)(powf(10.0f, _volume[0] / 256.0f / 20.0f) * 65536.0f);
    if (_bits_per_sample == 16) {
      int16_t *src = (int16_t *) data;
      int16_t *limit = (int16_t *) data + len / 2;
      while (src < limit) {
        *src = (int16_t)(((int32_t)*src * vol_mul) >> 16);
        src++;
      }
    } else {
      int32_t *src = (int32_t *) data;
      int32_t *limit = (int32_t *) data + len / 4;
      while (src < limit) {
        *src = (int32_t)(((int64_t)*src * vol_mul) >> 16);
        src++;
      }
    }
  }
}

void USBAudioCard::onData(arduino_usb_audio_card_data_handler_t callback) {
  _cb = callback;
}

uint16_t USBAudioCard::write(const void *data, uint16_t len) {
  if (_uac != NULL) {
    return tud_audio_write(data, len);
  }
  return 0;
}

void USBAudioCard::onEvent(esp_event_handler_t callback) {
  onEvent(ARDUINO_USB_AUDIO_CARD_ANY_EVENT, callback);
}

void USBAudioCard::onEvent(arduino_usb_audio_card_event_t event, esp_event_handler_t callback) {
  arduino_usb_event_handler_register_with(ARDUINO_USB_AUDIO_CARD_EVENTS, event, callback, this);
}

#endif /* CONFIG_TINYUSB_AUDIO_ENABLED */
#endif /* SOC_USB_OTG_SUPPORTED */
